tutorials/compressible/rhoCentralFoam/LadenburgJet60psi/0.org/T
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 247.1;
    }

    outlet
    {
        type            zeroGradient;
    }

    freestream
    {
        type            totalTemperature;
        value           uniform 297;
        T0              uniform 297;
		U               U;
        phi             phi;
        rho             none;
        psi             psi;
        gamma           1.4;
    }

    freestreamInlet
    {
        type            fixedValue;
        value           uniform 297.0;
    }

    wedge1 {type wedge;}
    wedge2 {type wedge;}
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
